20260407205620-agm_vipul_2026.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-04-14 Tue 03:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>AGM vipul 2026</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">AGM vipul 2026</h1>
<div id="outline-container-org8a966f9" class="outline-2">
<h2 id="org8a966f9">Slide 1 - Current Roles and responsibilities</h2>
<div class="outline-text-2" id="text-org8a966f9">
<ul class="org-ul">
<li>Chief Sales Co-ordinator.</li>
<li>Role
<ol class="org-ol">
<li>Be responsible for end to end deal closures of Team and myself</li>
<li>Ensure the sales and deal closure process as carried by team is followed by the defined process.</li>
<li>To monitor and ensure deal are taken toward closure, ensure needed handover and get involved as needed to get them closed. .</li>
</ol></li>
</ul>
</div>
</div>

<div id="outline-container-org6848c5b" class="outline-2">
<h2 id="org6848c5b">Slide 2 Responsibilty</h2>
<div class="outline-text-2" id="text-org6848c5b">
<ol class="org-ol">
<li>Every deal, negotiation, visit, handover is carried on time, efficiently and is followed as per the defined process.</li>
<li>Monitor the sales activity and make sure the defined process and systems are followed.</li>
<li>Deal Closure - Cold Calls -&gt; Visits -&gt; Negotiations -&gt; Closures.</li>
<li>Make sure We meet the Sales target defined by organisation for the defined time.</li>
<li>End to End cordination of all deals which involve -</li>
<li>Cold calls, visits, discussions, negotiations, via call, text, mail etc.</li>
<li>The defined Target is achieved by each individual and everyone in the team is working towards fulfiling it.</li>
</ol>
</div>
</div>

<div id="outline-container-orge22d373" class="outline-2">
<h2 id="orge22d373">Slide 3 Future plans and strategy with S.M.A.R.T. numbers.</h2>
<div class="outline-text-2" id="text-orge22d373">
<ol class="org-ol">
<li>Future plan to increase this number by 2X
Ways to achive it
<ul class="org-ul">
<li>make twice the revenue.</li>
<li>increase the gross margin from the current standard to a double digit.</li>
<li>Reduce the average TAT of higher value [10 lakhs+] and higher margin deals from 24 days to 10 days.</li>
<li>Reduce the small ticket deal value TAT to within 7 days.</li>
</ul></li>
</ol>
</div>
</div>
<div id="outline-container-org038e60d" class="outline-2">
<h2 id="org038e60d">The Plan -</h2>
<div class="outline-text-2" id="text-org038e60d">
</div>
<div id="outline-container-orgac08825" class="outline-3">
<h3 id="orgac08825">1 Analyse the current deal flow, conversion bottlneck for each stage.</h3>
<div class="outline-text-3" id="text-orgac08825">
<ul class="org-ul">
<li>calculate drop off % for each stage</li>
</ul>
</div>
</div>

<div id="outline-container-org074fbf0" class="outline-3">
<h3 id="org074fbf0">Drop low prob deals fast.</h3>
<div class="outline-text-3" id="text-org074fbf0">
<p>
Score deals with 30% and lower turnaround probability, exit decision for it done within 3 days or less.
</p>
</div>
</div>

<div id="outline-container-org680d324" class="outline-3">
<h3 id="org680d324">TAT reduction: 21 to 11 or lesser days.</h3>
<div class="outline-text-3" id="text-org680d324">
<p>
Define stage level benchmark, for e.g. visit planned within 3 days, negotiation closed within 5 days.
stuck deals to be escalated to a higher up at the 7 day mark.
</p>
</div>
</div>

<div id="outline-container-org420ef26" class="outline-3">
<h3 id="org420ef26">High Revenue deal focus.</h3>
<div class="outline-text-3" id="text-org420ef26">
<p>
Prioritise deals of 18 lakhs and higher.
same team effort 2x revenue
</p>
</div>
</div>

<div id="outline-container-org99727c4" class="outline-3">
<h3 id="org99727c4">Increase margin by book and sell model</h3>
<div class="outline-text-3" id="text-org99727c4">
<p>
The deal mix to be brought to 60% book and sell to achieve 10% avg margin.
current margin is TPH fees heavy
book and sell adds 5 to 8% margin.
Small ticket deals have scope for margin,
once identified immediate escalation to higher authority.
</p>
</div>
</div>

<div id="outline-container-org6e1437a" class="outline-3">
<h3 id="org6e1437a">Small ticket size deal should be fast tracked.</h3>
<div class="outline-text-3" id="text-org6e1437a">
<p>
delegate close within 7 days.
Reduce senior bandwidth involvement in these deals.
</p>
<ul class="org-ul">
<li>Create a delegation SOP for small deal closers in the team.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org3bd8bfc" class="outline-2">
<h2 id="org3bd8bfc">Slide 4 Mentorship</h2>
<div class="outline-text-2" id="text-org3bd8bfc">
<ol class="org-ol">
<li>Nurture and form high agency team of leaders.
Build a team of high-agency individuals who own outcomes, not just tasks.
<ul class="org-ul">
<li>Monthly 1:1 reviews tied to individual deal KPIs</li>
<li>Encourage team members to bring deal strategies, not just problems</li>
</ul></li>

<li>Equip the team with right tools to achieve it.</li>
<li>Impart a Technology savvy culture
Train team on various tools.
<ul class="org-ul">
<li>mindset to find the optimum way of doing work instead of repetitive work</li>
<li>focus on the key deal closure characteristics instead of focusing on the mundane task.</li>
<li>use AI to find automation in these segments.</li>
<li>make team ready for the technical know how for the products available and efficient communication of the same.</li>
</ul></li>
<li>make my team equipped and familiar with all the tools and technology that would help them focus on the right and skip the mundane, thus optimising.</li>
</ol>
</div>
</div>

<div id="outline-container-org4754ba4" class="outline-2">
<h2 id="org4754ba4">How We Measure Team Performance</h2>
<div class="outline-text-2" id="text-org4754ba4">
<p>
Each team member reviewed fortnightly on:
</p>
<ul class="org-ul">
<li>Deals owned (pipeline size)</li>
<li>Conversion % (leads → closures)</li>
<li>Average TAT per deal</li>
<li>Margin per deal</li>
<li>Target achievement % vs monthly goal</li>
</ul>
</div>
</div>
</div>
</body>
</html>